[
  "They took a coffee break during the op. Anesthesia started wearing off and I felt everything. Worst day of my life.",
  "Yes,,,Absolutely I don't think this is the hospital or the hotel!! So really it's big hospital and very organized, looking New, nice clean, people really kindly, good service, professional people who work here, and many good doctors here,just walked into quite early the restaurant not open until 7am, yes! Was amazing Inselspital It is a hospital built with modern infrastructure, including several very tall patient buildings. Also known as the University Hospital of Bern, located in Bern, it is one of five university hospitals in Switzerland.",
  "Great staff at orthopedy! Long waiting time (5 hours) but also fair to the case I had. Need to add 4 months later, that it was unfortunately a wrong diagnosis. I had multiple fracture at the foot and I was only given crutches because I asked to. Initial diagnosis was for a OSG of 2. grade. Still, good people there but I am shocked that both assistant doctor and doctor missed it.",
  "If you are having an emergency in the middle of the night I suggest not going here. During the day I think they might be better but at night they're basically closed. Nurses and docs are not empowered to treat patients. They also seem overloaded.",
  "Probably the best hospital I've ever been to. I was transported to the emergency station. The doctors and nurses were especially kind and nice. Very concerned about my wellbeing. Had the surgery at the same day even though it was a Sunday afternoon. The restaurant at the top of the famous Bettenhochhaus is not as expensive as you might think for Swiss standards. At a lovely sunny day you will get a great view over the city of Bern. But don't try to eat at noon your lunch, because this place will be crowded with nurses and doctors. You can try if you like to wait.",
  "I, as the family member of a patient, had a bad experience interacting with the staff in the hospital. First, lots of critical info has not been provided to the patient in time. The schedule for the surgery, the medical treatment, and the discharging time kept changing. The critical info reached us in the last few hours. For example, there were absolutely no updates on when the patient can be discharged throughout the treatment and all of the sudden we were notified in the morning that we had to leave the hospital by 5 p.m. the same day. Second, I feel disrespected when communicating with some nurses/doctors and annoyed by their impatience (some of them are very friendly).",
  "1 star goes to the emergency service. It is not acceptable for a hospital of this size and importance to have such a poor emergency service in terms of waiting time. I'm undergoing cancer treatment and I caught an infection in Port a few days ago. Every doctor I spoke to repeated that if I have a fever, chills or dizziness I should come to the emergency room immediately, so I did. I had a fever and chills this evening and when I called the oncology emergency department, the doctor advised me to come here. I arrived at 9pm and now it is after 1am and there is no sign of service. It's a lack of respect for the patient and a risk to life too, I have a catheter in one of my main veins in my neck with a ball of pus + immunity is low due to chemotherapy. This cannot be called an emergency service if the patient has to wait 4h/5h to be seen.",
  "I came in on the 17th of June due to a work accident. After a failed treatment at a clinic, I was taken care by Dr. Janina who I would like to thank very much. I'd also like to thank the nurses who also took care of me. Everyone was outstanding.",
  "I am writing from my Hospital room before being discharged tomorrow.This the second time I have been admitted here for a week of treatment. The staff have been great. Friendly, attentive and informative as were the Doctors. Always explaining things not understood in lay terms and always available. The food, well it is an Hospital and not a Michelin Restaurant, so actually quite good. Thank you all for your care and attention.",
  "My dad was supposed to have a surgery on 8 am after the hospital gave an appointment. He wasn't allowed to eat or drink from midnight til the surgery. But they somehow had a \"communication error\" saying that the operation room got occupied by another patient after 8 HOURS!! My dad had to wait 8 HOURS in pain without any food or water waiting for the doctor to do the operation in the room. But NOTHING!! It was so irresponsible of them! It felt insulting as if they were looking down on us because we are of different race. I felt so bad for my dad!! Now the operation is gonna take place tomorrow! I had expected better from the hospital!! I wouldn't even give 1 star if I could but unfortunately I have to, to write this review!!"
]
